{
    "URL": "https://github.com/verilator/verilator/issues/3060",
    "Summary": "Overriding untyped parameter with -G produces incorrect result",
    "Description": "I've been testing a floating point format converter which is a part of the hardfloat library. I've tried simulating the the module using both iverilog and verilator and the verilator testbench is consistently giving me the wrong results for certain testcases, all of which work fine in iverilog. I've attached the testbench and an offending testcase below (for converting double precision to single precision) :\n#include <verilated.h>\n#include <verilated_vcd_c.h>\n#include <VrecFNToRecFN.h>\n#include <iostream>\n\nvluint64_t sim_time = 0; \n\ndouble sc_time_stamp () {  return sim_time;  }\n\nint main(int argc, char** argv, char** env){\n    if (0 && argc && argv && env) {}\n    Verilated::commandArgs (argc, argv);\n\n    VrecFNToRecFN *dut = new VrecFNToRecFN;\n\n    Verilated::traceEverOn(true);\n    VerilatedVcdC *m_trace = new VerilatedVcdC;\n    dut->trace(m_trace, 5);\n    m_trace->open(\"waveform.vcd\");\n\n    while (sim_time < 20)\n    {\n        dut->control = 1;\n        dut->in[0] = 0xD93441A8;\n        dut->in[1] = 0x5897D9AA;\n        dut->in[2] = 0x0;\n        dut->roundingMode = 0;\n        dut->eval();\n        m_trace->dump(sim_time);\n        sim_time++;\n    }\n    std::cout << dut->out;\n    m_trace->close();\n    delete dut;\n    exit(0);\n}\n\nAnd here are the waveform dumps for\niverilog:\n\nverilator:\n\nThe signals of significance are the 33 bit output and the 5 bit output exception flags. The module in question is completely combinational. The compiler directives I used are -Wall -Wno-fatal and --trace.\nI've attached all the relevant source files and testbenches and their outputs in my repo : https://github.com/Anikin1610/DPtoSP_debug\nI've been told that the author of this library had also used verilator while testing it so I'm inclined to believe that this isn't an issue with the IP per se. I'm using Verilator 4.204 2021-06-12 rev v4.204-18-gfa3c072d built from the github source.\nAny thoughts on why I'm facing this issue is much appreciated. Thanks in advance!"
}